master.org
* Master Reference File of notes

[[http://www.roguebasin.com/index.php?title%3DMain_Page][Roguelike wiki]]
[[http://users.soe.ucsc.edu/~jgrey][Ucsc Home Page]]
[[https://github.com/jgrey4296][Github]]
[[https://sccountybank.com/olblogin.cfm?lt%3Dpersonal][bank login]]
[[https://www.myprepaidrefill.com/MobilityUSWeb/anonTopupStart.do?isGift%3Dfalse][Phone Top Up]]
[[http://www2.ucsc.edu/courses/cmps112-wm/:/][112 Course Page]]

** Research

Alpha House - Command Rape

[[file:culturalAntroNotes][Cultural Anthropology Notes]]

*** Writing

    [[file:siaWritings][Sia Writings]]


*** Theory

[[http://qz.com/301150/this-is-the-proof-that-the-1-have-been-running-the-show-for-800-years/][Persistent status through centuries]]

**** Main

Social Modeling + 
Tribal Structures + 
Higher Degree Social Action = Socio-Institutional Activity

***** Social Modeling
      Cif and Praxis enable charismatic and dialogue focused
      interactions

***** Tribal Structures
      Generative collections of rules that structure behaviour
      Fulfilling any number of purposes

***** High Degree Social Action
      Castelfranchi's orders of action rely on
      intention, but intention can be encoded or
      displayed in ritual.  Thus, giving ways to
      interpret action, and work towards higher
      social action.
      
***** Socio-institutional activity
      [[file:argumentOverview][Main Arguments]]

***** Socio-Tribal Activity
***** Socio-institutional Activity

[[file:research/sia][Socio Institutional Activity]]     
[[file:48laws][The 48 Laws of Power]]
[[file:socialStructures][Social Structures Notes]]

[[file:research/extracts][Fiction Extracts 1]]
[[file:research/extracts2][Fiction Extracts 2]]
[[file:research/extractsDiscussion][Discussion of Fiction Extracts]]


**** Related

[[file:research/compSocScience][Computational Social Science Notes]]
[[file:castelfranchi][Types of Social Actions, CastelFranchi]]


*** Architecture
   
    Modificaions/uses of CiF/Praxis


*** Implementation

    [[file:tribeDescriptions][Tribe Descriptions]]

    Thought process during the vanishing of ethan carter: 'when's this
    set again? oh, theres telephone wires so that puts me somewhere
    around 1900'. This, but procedural.

    [[file:research/gamesPrototypes][Game Prototype Ideas]]

*** Obselete


*** Links
[[http://en.wikipedia.org/wiki/Gossip][Gossip]]  
[[http://www.gutenberg.org/files/14314/14314-h/14314-h.htm][Emily Post]]
[[http://en.wikipedia.org/wiki/Diplomacy][Diplomacy]]
[[http://en.wikipedia.org/wiki/Style_%2528manner_of_address%2529][Manner of Address]]
[[http://en.wikipedia.org/wiki/T%25E2%2580%2593V_distinction][T-V distinction]]
[[http://en.wikipedia.org/wiki/Honorifics_%2528linguistics%2529][Honourifics]]
[[http://en.wikipedia.org/wiki/Social_distance][Social Distance]]
[[http://en.wikipedia.org/wiki/Polite_fiction][Polite Fiction]]
[[http://en.wikipedia.org/wiki/Creole_language][Creole]]
[[http://en.wikipedia.org/wiki/Ali%25C3%25A9nor_de_Poitiers][Alienor De Poitiers]]
[[http://en.wikipedia.org/wiki/Court_%2528royal%2529][Royal Court]]


[[http://books.google.com/books?id%3Dddc9AAAAIAAJ&pg%3DPA47&lpg%3DPA47&dq%3DOn%2Bthe%2Bdynamics%2Bof%2Bsocial%2Bnorms%2BPier%2BLuigi%2BSacco&source%3Dbl&ots%3D0wbwLqDCY6&sig%3D7Kj3qx3mqy6-V6z_1TKkQiBrTXg&hl%3Den&sa%3DX&ei%3Df0F8VLKSKbSasQSUtYCQDQ&ved%3D0CCcQ6AEwAQ#v%3Donepage&q%3DOn%2520the%2520dynamics%2520of%2520social%2520norms%2520Pier%2520Luigi%2520Sacco&f%3Dfalse][On the Dynamics of Social Norms]]
[[http://www.cambridge.org/us/academic/subjects/philosophy/philosophy-science/dynamics-norms][Dynamics of Norms]]
[[http://sites.sas.upenn.edu/behav-ethics/files/norms_and_beliefs-_how_change_occurs_copy.pdf][Norm and Beliefs: How Change Occurs]]
[[http://sites.sas.upenn.edu/behav-ethics/publications][Behavioural Ethics Lab]]
[[http://en.wikipedia.org/wiki/Cristina_Bicchieri][Bicchieri]]
[[http://en.wikipedia.org/wiki/Linguistic_anthropology][Linguistic Anthropology]]
[[http://en.wikipedia.org/wiki/Social_anthropology][Social Anthro]]
[[http://en.wikipedia.org/wiki/Cultural_anthropology][Cultural Anthro]]
[[http://en.wikipedia.org/wiki/Ruth_Benedict#Patterns_of_Culture][Patterns of Culture]]


** Programming

*** Languages

[[http://www.dabeaz.com/ply/][PLY]]
[[https://theantlrguy.atlassian.net/wiki/display/ANTLR4/ANTLR%2B4%2BDocumentation][ANTLR]]
   
*** Music
    Supercollider or chuck,
    or perl/python for that matter

**** Define a scale

**** Define chords

**** Generate patterns

***** Note Patterns

***** Rhythm patterns

**** Order operations
     concat, mix.
     combinations, reversals etc

**** Classifiers


*** Image

http://www.redblobgames.com/grids/hexagons/

