notes/master.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>master</title>
<!-- 2014-12-04 Thu 02:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="jg" />
</head>
<body>
<div id="content">
<h1 class="title">master</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Master Reference File of notes</a>
<ul>
<li><a href="#sec-1-1">1.1. Research</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Writing</a></li>
<li><a href="#sec-1-1-2">1.1.2. Theory</a></li>
<li><a href="#sec-1-1-3">1.1.3. Architecture</a></li>
<li><a href="#sec-1-1-4">1.1.4. Implementation</a></li>
<li><a href="#sec-1-1-5">1.1.5. Obselete</a></li>
<li><a href="#sec-1-1-6">1.1.6. Links</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Programming</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Languages</a></li>
<li><a href="#sec-1-2-2">1.2.2. Music</a></li>
<li><a href="#sec-1-2-3">1.2.3. Image</a></li>
<li><a href="#sec-1-2-4">1.2.4. Web</a></li>
<li><a href="#sec-1-2-5">1.2.5. Dwarf Fortress</a></li>
<li><a href="#sec-1-2-6">1.2.6. NLP</a></li>
<li><a href="#sec-1-2-7">1.2.7. Metasteam</a></li>
<li><a href="#sec-1-2-8">1.2.8. Social Simulation</a></li>
<li><a href="#sec-1-2-9">1.2.9. <span class="todo TODO">TODO</span> </a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Languages</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Main Use Languages:</a></li>
<li><a href="#sec-1-3-2">1.3.2. Specific Use Languages</a></li>
<li><a href="#sec-1-3-3">1.3.3. Class Use Languages:</a></li>
<li><a href="#sec-1-3-4">1.3.4. Other:</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Programs</a></li>
<li><a href="#sec-1-5">1.5. Web</a></li>
<li><a href="#sec-1-6">1.6. Other</a></li>
<li><a href="#sec-1-7">1.7. Mac State</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1. Audio instruments</a></li>
<li><a href="#sec-1-7-2">1.7.2. Basic shell loading of dropbox:</a></li>
<li><a href="#sec-1-7-3">1.7.3. home folder symbolic links</a></li>
<li><a href="#sec-1-7-4">1.7.4. basic emacs setup:</a></li>
<li><a href="#sec-1-7-5">1.7.5. Hardware</a></li>
<li><a href="#sec-1-7-6">1.7.6. Programs</a></li>
<li><a href="#sec-1-7-7">1.7.7. Command line</a></li>
<li><a href="#sec-1-7-8">1.7.8. Macports:</a></li>
<li><a href="#sec-1-7-9">1.7.9. Preferences</a></li>
</ul>
</li>
<li><a href="#sec-1-8">1.8. TAing</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Master Reference File of notes</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://www.roguebasin.com/index.php?title=Main_Page">Roguelike wiki</a>
<a href="http://users.soe.ucsc.edu/~jgrey">Ucsc Home Page</a>
<a href="https://github.com/jgrey4296">Github</a>
<a href="https://sccountybank.com/olblogin.cfm?lt=personal">bank login</a>
<a href="https://www.myprepaidrefill.com/MobilityUSWeb/anonTopupStart.do?isGift=false">Phone Top Up</a>
<a href="http://www2.ucsc.edu/courses/cmps112-wm/:/">112 Course Page</a>
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Research</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Writing</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<a href="siaWritings">Sia Writings</a>
</p>
</div>
</div>


<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Theory</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<a href="http://qz.com/301150/this-is-the-proof-that-the-1-have-been-running-the-show-for-800-years/">Persistent status through centuries</a>
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-1-2-1" name="sec-1-1-2-1"></a>Main<br  /><div class="outline-text-5" id="text-1-1-2-1">
<p>
Social Modeling + 
Tribal Structures + 
Higher Degree Social Action = Socio-Institutional Activity
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-1-2-1-1" name="sec-1-1-2-1-1"></a>Social Modeling<br  /><div class="outline-text-6" id="text-1-1-2-1-1">
<p>
Cif and Praxis enable charismatic and dialogue focused
interactions
</p>
</div>
</li>

<li><a id="sec-1-1-2-1-2" name="sec-1-1-2-1-2"></a>Tribal Structures<br  /><div class="outline-text-6" id="text-1-1-2-1-2">
<p>
Generative collections of rules that structure behaviour
Fulfilling any number of purposes
</p>
</div>
</li>

<li><a id="sec-1-1-2-1-3" name="sec-1-1-2-1-3"></a>High Degree Social Action<br  /><div class="outline-text-6" id="text-1-1-2-1-3">
<p>
Castelfranchi's orders of action rely on
intention, but intention can be encoded or
displayed in ritual.  Thus, giving ways to
interpret action, and work towards higher
social action.
</p>
</div>
</li>

<li><a id="sec-1-1-2-1-4" name="sec-1-1-2-1-4"></a>Socio-institutional activity<br  /><div class="outline-text-6" id="text-1-1-2-1-4">
<p>
<a href="argumentOverview">Main Arguments</a>
</p>
</div>
</li>

<li><a id="sec-1-1-2-1-5" name="sec-1-1-2-1-5"></a>Socio-Tribal Activity<br  /></li>
<li><a id="sec-1-1-2-1-6" name="sec-1-1-2-1-6"></a>Socio-institutional Activity<br  /><div class="outline-text-6" id="text-1-1-2-1-6">
<p>
<a href="research/sia">Socio Institutional Activity</a>     
<a href="48laws">The 48 Laws of Power</a>
<a href="socialStructures">Social Structures Notes</a>
</p>

<p>
<a href="research/extracts">Fiction Extracts 1</a>
<a href="research/extracts2">Fiction Extracts 2</a>
<a href="research/extractsDiscussion">Discussion of Fiction Extracts</a>
</p>
</div>
</li></ol>
</li>


<li><a id="sec-1-1-2-2" name="sec-1-1-2-2"></a>Related<br  /><div class="outline-text-5" id="text-1-1-2-2">
<p>
<a href="research/compSocScience">Computational Social Science Notes</a>
<a href="castelfranchi">Types of Social Actions, CastelFranchi</a>
</p>
</div>
</li></ol>
</div>


<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Architecture</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Modificaions/uses of CiF/Praxis
</p>
</div>
</div>


<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Implementation</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
<a href="tribeDescriptions">Tribe Descriptions</a>
</p>

<p>
Thought process during the vanishing of ethan carter: 'when's this
set again? oh, theres telephone wires so that puts me somewhere
around 1900'. This, but procedural.
</p>

<p>
<a href="research/gamesPrototypes">Game Prototype Ideas</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Obselete</h4>
</div>


<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> Links</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
<a href="http://en.wikipedia.org/wiki/Gossip">Gossip</a>  
<a href="http://www.gutenberg.org/files/14314/14314-h/14314-h.htm">Emily Post</a>
<a href="http://en.wikipedia.org/wiki/Diplomacy">Diplomacy</a>
<a href="http://en.wikipedia.org/wiki/Style_%2528manner_of_address%2529">Manner of Address</a>
<a href="http://en.wikipedia.org/wiki/T%25E2%2580%2593V_distinction">T-V distinction</a>
<a href="http://en.wikipedia.org/wiki/Honorifics_%2528linguistics%2529">Honourifics</a>
<a href="http://en.wikipedia.org/wiki/Social_distance">Social Distance</a>
<a href="http://en.wikipedia.org/wiki/Polite_fiction">Polite Fiction</a>
<a href="http://en.wikipedia.org/wiki/Creole_language">Creole</a>
<a href="http://en.wikipedia.org/wiki/Ali%25C3%25A9nor_de_Poitiers">Alienor De Poitiers</a>
<a href="http://en.wikipedia.org/wiki/Court_%2528royal%2529">Royal Court</a>
</p>


<p>
<a href="http://books.google.com/books?id=ddc9AAAAIAAJ&pg=PA47&lpg=PA47&dq=On+the+dynamics+of+social+norms+Pier+Luigi+Sacco&source=bl&ots=0wbwLqDCY6&sig=7Kj3qx3mqy6-V6z_1TKkQiBrTXg&hl=en&sa=X&ei=f0F8VLKSKbSasQSUtYCQDQ&ved=0CCcQ6AEwAQ#v=onepage&q=On%2520the%2520dynamics%2520of%2520social%2520norms%2520Pier%2520Luigi%2520Sacco&f=false">On the Dynamics of Social Norms</a>
<a href="http://www.cambridge.org/us/academic/subjects/philosophy/philosophy-science/dynamics-norms">Dynamics of Norms</a>
<a href="http://sites.sas.upenn.edu/behav-ethics/files/norms_and_beliefs-_how_change_occurs_copy.pdf">Norm and Beliefs: How Change Occurs</a>
<a href="http://sites.sas.upenn.edu/behav-ethics/publications">Behavioural Ethics Lab</a>
<a href="http://en.wikipedia.org/wiki/Cristina_Bicchieri">Bicchieri</a>
<a href="http://en.wikipedia.org/wiki/Linguistic_anthropology">Linguistic Anthropology</a>
<a href="http://en.wikipedia.org/wiki/Social_anthropology">Social Anthro</a>
<a href="http://en.wikipedia.org/wiki/Cultural_anthropology">Cultural Anthro</a>
<a href="http://en.wikipedia.org/wiki/Ruth_Benedict#Patterns_of_Culture">Patterns of Culture</a>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Programming</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Languages</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<a href="http://www.dabeaz.com/ply/">PLY</a>
<a href="https://theantlrguy.atlassian.net/wiki/display/ANTLR4/ANTLR+4+Documentation">ANTLR</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Music</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Supercollider or chuck,
or perl/python for that matter
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>Define a scale<br  /></li>

<li><a id="sec-1-2-2-2" name="sec-1-2-2-2"></a>Define chords<br  /></li>

<li><a id="sec-1-2-2-3" name="sec-1-2-2-3"></a>Generate patterns<br  /><ol class="org-ol"><li><a id="sec-1-2-2-3-1" name="sec-1-2-2-3-1"></a>Note Patterns<br  /></li>

<li><a id="sec-1-2-2-3-2" name="sec-1-2-2-3-2"></a>Rhythm patterns<br  /></li></ol>
</li>

<li><a id="sec-1-2-2-4" name="sec-1-2-2-4"></a>Order operations<br  /><div class="outline-text-5" id="text-1-2-2-4">
<p>
concat, mix.
combinations, reversals etc
</p>
</div>
</li>

<li><a id="sec-1-2-2-5" name="sec-1-2-2-5"></a>Classifiers<br  /></li></ol>
</div>


<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Image</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
<a href="http://www.redblobgames.com/grids/hexagons/">http://www.redblobgames.com/grids/hexagons/</a>
</p>
</div>
</div>
