master.org
*** Web
    Victoria and Albert Museum web api: http://www.vam.ac.uk/api/
https://www.flickr.com/services/api/
https://github.com/lizadaly/nanogenmo2014
http://jinja.pocoo.org/
https://github.com/galaxykate/PCGTutorials

*** Dwarf Fortress
    


*** NLP
**** Supreme Court Parsing
**** Abl Parsing
**** Novels parsing


*** Metasteam

*** Social Simulation
**** Tribes
**** Institutions
**** Resources
**** Knowledge
**** Time
**** Conversation
     Speech Acts
     grammar generation
     


*** TODO


**** social Roguelike:
***** camera follow
***** working doors
***** animation state machine
***** melee
***** pathfinding
***** click to move
***** Game Logic

**** Traditional Roguelikes
     
**** Social Play


**** Space strategy

**** Movement
**** Building
**** Combat
  
**** Walking Simulator

**** Thud
***** Board
      Generation of board tiles,
      public access to tiles
***** Tile
      Tile has a stack of what units are on it
***** Pieces
      Move to any adjacent tile
      decision procedures

***** Movement
      piece decides to move, gets the tile moving to from the board, updates the tile state
***** Taking
      two pieces, most likely on the same tile, 
***** Combination Attacks
      for later
***** Score keeping
      for later
      

** Languages

*** Main Use Languages:

[[file:languages/javascript][Javascript]]
[[file:languages/csharp][C#]]
[[file:languages/unity][Unity]]
[[file:languages/perl][Perl]]
[[file:languages/python][Python]]

[[file:languages/shell][Shell]]
[[file:languages/docgen][Documentation Generation]]

*** Specific Use Languages

[[file:languages/asp][ASP]]   
[[file:languages/prolog][Prolog	]]
[[file:languages/chuck][Chuck]]
[[file:languages/supercollider][Supercollider]]
[[file:languages/scheme][Scheme]]
[[file:languages/lisp][Lisp]]
[[file:languages/haskell][Haskell]]
    
*** Class Use Languages:
    
[[file:languages/cpp][C++]]
[[file:languages/smalltalk][Smalltalk]]
[[file:languages/ocaml][Ocaml]]
[[file:languages/erlang][Erlang]]

*** Other:

TODO: yas for doxygen

[[file:languages/libraries][Interesting Libraries]]
[[file:lang-template][Language Template]]


** Programs


[[file:programs/blender][Blender]]
[[file:programs/emacs][Emacs]]
[[file:programs/gimp][Gimp]]
[[file:programs/logic][Logic]]
[[file:programs/steamGames][Steam Game Notes]]

[[http://www.mactricksandtips.com/2008/07/convert-images-using-terminal.html][Sips (image processing)]]

** Web

[[file:web/links][Unorganised Links]]

[[file:web/rpsNotes][Rock Paper Shotgun]]

[[file:web/usefulLinks][Misc Useful Links]]


** Other

[[file:other/writing][Writing Notes]]

[[file:other/ai][AI]]

[[file:other/assets][Assets]]

[[file:other/algorithms][Algorithms Notes]]

[[file:other/patterns][Design Patterns]]

[[file:other/probability][Probability Notes]]

[[file:other/stats][Statistics notes]]

[[file:other/vectorMath][Vector Math Notes]]

[[file:other/nlp][NLP Notes]]

[[file:other/notebook_notes][Extracts from Physical Notebooks]]

[[file:other/imageComments][Comments on Images of Interest]]

[[file:other/scratch][Old Scratch Buffer]]







** Mac State
   xcode, cltools
   python
   anaconda
   nltk
   macports
   fink

*** Audio instruments
    ilok

*** Basic shell loading of dropbox:
!!! upgrade from standard bash
source ~/dropbox/scripts/shell/main_bash

*** home folder symbolic links
    photos, assets, bitcasa, docs,
    dropbox, dwarf, github, latexImages
    programming
    projects
    snippets
    templates
    .emacs.d
    notes

    node package manager
    
*** basic emacs setup:
(load "~/.emacs.d/my.emacs")

*** Hardware
    Wacom, keyboard, soundcard
    printer, kinect camera


*** Programs

 Arturia/
 Blender/
 KORG/
 MacPorts/
 Native Instruments/
 SuperCollider/
 URS/
 Unity/
 Waves/
 All2MP3.app/
 Flux.app/
 Fluxus.app/
 Gimp.app/
 HandBrake.app/
 Inkscape.app/
 Mountain.app/
 OSC Monitor.app/
 SizeUp.app/
 Tiled.app/
 VLC.app/
 Zwoptex.app/
 avast!.app/
 calibre.app/
 Wacom Tablet.localized/

