notes/master.html

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Web</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Victoria and Albert Museum web api: <a href="http://www.vam.ac.uk/api/">http://www.vam.ac.uk/api/</a>
<a href="https://www.flickr.com/services/api/">https://www.flickr.com/services/api/</a>
<a href="https://github.com/lizadaly/nanogenmo2014">https://github.com/lizadaly/nanogenmo2014</a>
<a href="http://jinja.pocoo.org/">http://jinja.pocoo.org/</a>
<a href="https://github.com/galaxykate/PCGTutorials">https://github.com/galaxykate/PCGTutorials</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Dwarf Fortress</h4>
</div>



<div id="outline-container-sec-1-2-6" class="outline-4">
<h4 id="sec-1-2-6"><span class="section-number-4">1.2.6</span> NLP</h4>
<div class="outline-text-4" id="text-1-2-6">
</div><ol class="org-ol"><li><a id="sec-1-2-6-1" name="sec-1-2-6-1"></a>Supreme Court Parsing<br  /></li>
<li><a id="sec-1-2-6-2" name="sec-1-2-6-2"></a>Abl Parsing<br  /></li>
<li><a id="sec-1-2-6-3" name="sec-1-2-6-3"></a>Novels parsing<br  /></li></ol>
</div>


<div id="outline-container-sec-1-2-7" class="outline-4">
<h4 id="sec-1-2-7"><span class="section-number-4">1.2.7</span> Metasteam</h4>
</div>

<div id="outline-container-sec-1-2-8" class="outline-4">
<h4 id="sec-1-2-8"><span class="section-number-4">1.2.8</span> Social Simulation</h4>
<div class="outline-text-4" id="text-1-2-8">
</div><ol class="org-ol"><li><a id="sec-1-2-8-1" name="sec-1-2-8-1"></a>Tribes<br  /></li>
<li><a id="sec-1-2-8-2" name="sec-1-2-8-2"></a>Institutions<br  /></li>
<li><a id="sec-1-2-8-3" name="sec-1-2-8-3"></a>Resources<br  /></li>
<li><a id="sec-1-2-8-4" name="sec-1-2-8-4"></a>Knowledge<br  /></li>
<li><a id="sec-1-2-8-5" name="sec-1-2-8-5"></a>Time<br  /></li>
<li><a id="sec-1-2-8-6" name="sec-1-2-8-6"></a>Conversation<br  /><div class="outline-text-5" id="text-1-2-8-6">
<p>
Speech Acts
grammar generation
</p>
</div>
</li></ol>
</div>



<div id="outline-container-sec-1-2-9" class="outline-4">
<h4 id="sec-1-2-9"><span class="section-number-4">1.2.9</span> <span class="todo TODO">TODO</span> </h4>
<div class="outline-text-4" id="text-1-2-9">
</div><ol class="org-ol"><li><a id="sec-1-2-9-1" name="sec-1-2-9-1"></a>social Roguelike:<br  /><ol class="org-ol"><li><a id="sec-1-2-9-1-1" name="sec-1-2-9-1-1"></a>camera follow<br  /></li>
<li><a id="sec-1-2-9-1-2" name="sec-1-2-9-1-2"></a>working doors<br  /></li>
<li><a id="sec-1-2-9-1-3" name="sec-1-2-9-1-3"></a>animation state machine<br  /></li>
<li><a id="sec-1-2-9-1-4" name="sec-1-2-9-1-4"></a>melee<br  /></li>
<li><a id="sec-1-2-9-1-5" name="sec-1-2-9-1-5"></a>pathfinding<br  /></li>
<li><a id="sec-1-2-9-1-6" name="sec-1-2-9-1-6"></a>click to move<br  /></li>
<li><a id="sec-1-2-9-1-7" name="sec-1-2-9-1-7"></a>Game Logic<br  /></li></ol>
</li>

<li><a id="sec-1-2-9-2" name="sec-1-2-9-2"></a>Traditional Roguelikes<br  /></li>

<li><a id="sec-1-2-9-3" name="sec-1-2-9-3"></a>Social Play<br  /></li>


<li><a id="sec-1-2-9-4" name="sec-1-2-9-4"></a>Space strategy<br  /></li>

<li><a id="sec-1-2-9-5" name="sec-1-2-9-5"></a>Movement<br  /></li>
<li><a id="sec-1-2-9-6" name="sec-1-2-9-6"></a>Building<br  /></li>
<li><a id="sec-1-2-9-7" name="sec-1-2-9-7"></a>Combat<br  /></li>

<li><a id="sec-1-2-9-8" name="sec-1-2-9-8"></a>Walking Simulator<br  /></li>

<li><a id="sec-1-2-9-9" name="sec-1-2-9-9"></a>Thud<br  /><ol class="org-ol"><li><a id="sec-1-2-9-9-1" name="sec-1-2-9-9-1"></a>Board<br  /><div class="outline-text-6" id="text-1-2-9-9-1">
<p>
Generation of board tiles,
public access to tiles
</p>
</div>
</li>
<li><a id="sec-1-2-9-9-2" name="sec-1-2-9-9-2"></a>Tile<br  /><div class="outline-text-6" id="text-1-2-9-9-2">
<p>
Tile has a stack of what units are on it
</p>
</div>
</li>
<li><a id="sec-1-2-9-9-3" name="sec-1-2-9-9-3"></a>Pieces<br  /><div class="outline-text-6" id="text-1-2-9-9-3">
<p>
Move to any adjacent tile
decision procedures
</p>
</div>
</li>

<li><a id="sec-1-2-9-9-4" name="sec-1-2-9-9-4"></a>Movement<br  /><div class="outline-text-6" id="text-1-2-9-9-4">
<p>
piece decides to move, gets the tile moving to from the board, updates the tile state
</p>
</div>
</li>
<li><a id="sec-1-2-9-9-5" name="sec-1-2-9-9-5"></a>Taking<br  /><div class="outline-text-6" id="text-1-2-9-9-5">
<p>
two pieces, most likely on the same tile, 
</p>
</div>
</li>
<li><a id="sec-1-2-9-9-6" name="sec-1-2-9-9-6"></a>Combination Attacks<br  /><div class="outline-text-6" id="text-1-2-9-9-6">
<p>
for later
</p>
</div>
</li>
<li><a id="sec-1-2-9-9-7" name="sec-1-2-9-9-7"></a>Score keeping<br  /><div class="outline-text-6" id="text-1-2-9-9-7">
<p>
for later
</p>
</div>
</li></ol>
</li></ol>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Languages</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Main Use Languages:</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
<a href="languages/javascript">Javascript</a>
<a href="languages/csharp">C#</a>
<a href="languages/unity">Unity</a>
<a href="languages/perl">Perl</a>
<a href="languages/python">Python</a>
</p>

<p>
<a href="languages/shell">Shell</a>
<a href="languages/docgen">Documentation Generation</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Specific Use Languages</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
<a href="languages/asp">ASP</a>   
<a href="languages/prolog">Prolog    </a>
<a href="languages/chuck">Chuck</a>
<a href="languages/supercollider">Supercollider</a>
<a href="languages/scheme">Scheme</a>
<a href="languages/lisp">Lisp</a>
<a href="languages/haskell">Haskell</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Class Use Languages:</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
<a href="languages/cpp">C++</a>
<a href="languages/smalltalk">Smalltalk</a>
<a href="languages/ocaml">Ocaml</a>
<a href="languages/erlang">Erlang</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Other:</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
TODO: yas for doxygen
</p>

<p>
<a href="languages/libraries">Interesting Libraries</a>
<a href="lang-template">Language Template</a>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Programs</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="programs/blender">Blender</a>
<a href="programs/emacs">Emacs</a>
<a href="programs/gimp">Gimp</a>
<a href="programs/logic">Logic</a>
<a href="programs/steamGames">Steam Game Notes</a>
</p>

<p>
<a href="http://www.mactricksandtips.com/2008/07/convert-images-using-terminal.html">Sips (image processing)</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Web</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="web/links">Unorganised Links</a>
</p>

<p>
<a href="web/rpsNotes">Rock Paper Shotgun</a>
</p>

<p>
<a href="web/usefulLinks">Misc Useful Links</a>
</p>
</div>
</div>


<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Other</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<a href="other/writing">Writing Notes</a>
</p>

<p>
<a href="other/ai">AI</a>
</p>

<p>
<a href="other/assets">Assets</a>
</p>

<p>
<a href="other/algorithms">Algorithms Notes</a>
</p>

<p>
<a href="other/patterns">Design Patterns</a>
</p>

<p>
<a href="other/probability">Probability Notes</a>
</p>

<p>
<a href="other/stats">Statistics notes</a>
</p>

<p>
<a href="other/vectorMath">Vector Math Notes</a>
</p>

<p>
<a href="other/nlp">NLP Notes</a>
</p>

<p>
<a href="other/notebook_notes">Extracts from Physical Notebooks</a>
</p>

<p>
<a href="other/imageComments">Comments on Images of Interest</a>
</p>

<p>
<a href="other/scratch">Old Scratch Buffer</a>
</p>
</div>
</div>







<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Mac State</h3>
<div class="outline-text-3" id="text-1-7">
<p>
xcode, cltools
python
anaconda
nltk
macports
fink
</p>
</div>

<div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> Audio instruments</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
ilok
</p>
</div>
</div>

<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> Basic shell loading of dropbox:</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
!!! upgrade from standard bash
source ~/dropbox/scripts/shell/main<sub>bash</sub>
</p>
</div>
</div>

<div id="outline-container-sec-1-7-3" class="outline-4">
<h4 id="sec-1-7-3"><span class="section-number-4">1.7.3</span> home folder symbolic links</h4>
<div class="outline-text-4" id="text-1-7-3">
<p>
photos, assets, bitcasa, docs,
dropbox, dwarf, github, latexImages
programming
projects
snippets
templates
.emacs.d
notes
</p>

<p>
node package manager
</p>
</div>
</div>

<div id="outline-container-sec-1-7-4" class="outline-4">
<h4 id="sec-1-7-4"><span class="section-number-4">1.7.4</span> basic emacs setup:</h4>
<div class="outline-text-4" id="text-1-7-4">
<p>
(load "~/.emacs.d/my.emacs")
</p>
</div>
</div>

<div id="outline-container-sec-1-7-5" class="outline-4">
<h4 id="sec-1-7-5"><span class="section-number-4">1.7.5</span> Hardware</h4>
<div class="outline-text-4" id="text-1-7-5">
<p>
Wacom, keyboard, soundcard
printer, kinect camera
</p>
</div>
</div>


<div id="outline-container-sec-1-7-6" class="outline-4">
<h4 id="sec-1-7-6"><span class="section-number-4">1.7.6</span> Programs</h4>
<div class="outline-text-4" id="text-1-7-6">
<p>
Arturia/
Blender/
KORG/
MacPorts/
Native Instruments/
SuperCollider/
URS/
Unity/
Waves/
All2MP3.app/
Flux.app/
Fluxus.app/
Gimp.app/
HandBrake.app/
Inkscape.app/
Mountain.app/
OSC Monitor.app/
SizeUp.app/
Tiled.app/
VLC.app/
Zwoptex.app/
avast!.app/
calibre.app/
Wacom Tablet.localized/
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-7-6-1" name="sec-1-7-6-1"></a>PATH<br  /><div class="outline-text-5" id="text-1-7-6-1">
<p>
