notes/master.html
<i>Volumes/Documents/dropbox/scripts/shell</i>:
/opt/local/libexec/gnubin:
/opt/local/include:
/opt/local/lib:
/opt/local/sbin:
/opt/local/bin:
/Volumes/Documents/Dropbox/Programming/Perl:
/Applications/SuperCollider:
/Volumes/Documents/Libraries/android-sdk-macosx/tools:
/Volumes/Documents/Libraries/android-sdk-macosx/platform-tools:
/Volumes/Documents/Libraries/android-sdk-macosx/build-tools/19.1.0:
/usr/local/bin:
<i>Users/jgrey/node<sub>modules</sub>:
/Volumes/Documents/dropbox/scripts/shell</i>:
/opt/local/libexec/gnubin:
/opt/local/include:
/opt/local/lib:
/opt/local/sbin:
/opt/local/bin:
/Volumes/Documents/Dropbox/Programming/Perl:
/Applications/SuperCollider:
/Volumes/Documents/Libraries/android-sdk-macosx/tools:
/Volumes/Documents/Libraries/android-sdk-macosx/platform-tools:
/Volumes/Documents/Libraries/android-sdk-macosx/build-tools/19.1.0:
/usr/local/bin:
/Users/jgrey/node<sub>modules</sub>:
/usr/bin:
/bin:
/usr/sbin:
/sbin
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-7-7" class="outline-4">
<h4 id="sec-1-7-7"><span class="section-number-4">1.7.7</span> Command line</h4>
</div>

<div id="outline-container-sec-1-7-8" class="outline-4">
<h4 id="sec-1-7-8"><span class="section-number-4">1.7.8</span> Macports:</h4>
<div class="outline-text-4" id="text-1-7-8">
<p>
antlr @2.7.7<sub>1</sub> (active)
atk @2.10.0<sub>0</sub>
autoconf @2.69<sub>2</sub> (active)
automake @1.14.1<sub>1</sub>
automake @1.14.1<sub>2</sub> (active)
bash @4.3.25<sub>0</sub> (active)
bash-completion @2.1<sub>8</sub> (active)
bison @2.7.1<sub>0</sub> (active)
boehmgc @7.4.2<sub>0</sub> (active)
boost @1.56.0<sub>1</sub>+no<sub>single</sub>+no<sub>static</sub>+python27 (active)
bzip2 @1.0.6<sub>0</sub> (active)
cairo @1.12.16<sub>2</sub>+x11 (active)
cctools @855<sub>1</sub>+llvm33 (active)
cctools-headers @855<sub>0</sub> (active)
cloog @0.18.2<sub>0</sub> (active)
cmake @3.0.2<sub>0</sub> (active)
coreutils @8.23<sub>0</sub> (active)
curl @7.38.0<sub>0</sub>+ssl (active)
curl-ca-bundle @7.38.0<sub>0</sub> (active)
cyrus-sasl2 @2.1.26<sub>4</sub>+kerberos (active)
db<sub>select</sub> @0.1<sub>2</sub> (active)
desktop-file-utils @0.22<sub>0</sub> (active)
detex @2.8<sub>1</sub> (active)
djvulibre @3.5.25<sub>8</sub> (active)
docbook-xsl @1.78.1<sub>1</sub> (active)
doxygen @1.8.7<sub>0</sub> (active)
dvipng @1.14<sub>8</sub> (active)
emacs @24.3<sub>1</sub> (active)
expat @2.1.0<sub>0</sub>+universal (active)
fftw-3 @3.3.4<sub>0</sub> (active)
fltk @1.3.2<sub>2</sub> (active)
fontconfig @2.11.0<sub>2</sub>
fontconfig @2.11.1<sub>0</sub> (active)
fop @1.1<sub>0</sub> (active)
freeglut @2.8.1<sub>0</sub> (active)
freetype @2.5.3<sub>1</sub> (active)
gawk @4.1.1<sub>2</sub> (active)
gcc48 @4.8.3<sub>0</sub> (active)
gcc<sub>select</sub> @0.1<sub>8</sub> (active)
gd2 @2.1.0<sub>6</sub>+x11 (active)
gdbm @1.11<sub>0</sub> (active)
gdk-pixbuf2 @2.31.1<sub>0</sub>+x11 (active)
gettext @0.19.2<sub>0</sub>+universal (active)
ghc @7.6.3<sub>4</sub>+gcc48 (active)
ghostscript @9.10<sub>2</sub>+x11 (active)
git @2.1.1<sub>0</sub>+credential<sub>osxkeychain</sub>+doc+pcre+perl5<sub>16</sub>+python27 (active)
git-core @1.9.3<sub>0</sub>+credential<sub>osxkeychain</sub>+doc+pcre+perl5<sub>16</sub>+python27
glib2 @2.42.0<sub>0</sub> (active)
glpk @4.48<sub>0</sub> (active)
gmp @6.0.0<sub>1</sub> (active)
gnutls @3.3.8<sub>0</sub> (active)
gobject-introspection @1.42.0<sub>0</sub> (active)
graphite2 @1.2.4<sub>0</sub> (active)
graphviz @2.38.0<sub>0</sub>+pangocairo+x11 (active)
grep @2.20<sub>0</sub> (active)
gtk-doc @1.20<sub>1</sub>+python27
gtk-doc @1.20<sub>2</sub>+python27
gtk-doc @1.20<sub>4</sub>+python27
gtk-doc @1.21<sub>0</sub>+python27 (active)
gtk2 @2.24.23<sub>0</sub>+x11
gtk2 @2.24.24<sub>0</sub>+x11 (active)
gtksourceview2 @2.10.5<sub>7</sub> (active)
gts @0.7.6<sub>2</sub> (active)
harfbuzz @0.9.35<sub>0</sub> (active)
harfbuzz-icu @0.9.35<sub>0</sub> (active)
haskell-mode.el @2.4<sub>0</sub> (active)
haskell-platform @2013.2.0.0<sub>0</sub> (active)
ispell @3.3.02<sub>2</sub> (active)
latex2html @2008<sub>3</sub> (active)
latexdiff @1.0.4<sub>0</sub> (active)
latexmk @4.39<sub>0</sub> (active)
LaTeXML @0.8.0<sub>1</sub> (active)
lcdf-typetools @2.99<sub>0</sub>+texlive (active)
lcms2 @2.6<sub>0</sub> (active)
ld64 @136<sub>2</sub>+llvm33
ld64 @236.3<sub>1</sub>+llvm33 (active)
lua @5.2.2<sub>1</sub>
lua @5.2.3<sub>0</sub> (active)
magit @1.2.0<sub>1</sub> (active)
ncurses @5.9<sub>2</sub>+universal (active)
netpbm @10.67.05<sub>0</sub> (active)
nettle @2.7.1<sub>0</sub> (active)
nosetests<sub>select</sub> @0.1<sub>0</sub> (active)
openexr @1.7.0<sub>0</sub> (active)
perl5.18 @5.18.2<sub>1</sub> (active)
pinentry @0.8.4<sub>0</sub> (active)
pkgconfig @0.28<sub>0</sub> (active)
poppler @0.26.4<sub>0</sub> (active)
poppler-data @0.4.7<sub>0</sub> (active)
popt @1.16<sub>0</sub> (active)
ppl @1.0<sub>2</sub>
ppl @1.1<sub>0</sub> (active)
ps2eps @1.68<sub>0</sub> (active)
pstree @2.36<sub>0</sub> (active)
psutils @p17<sub>1</sub> (active)
pth @2.0.7<sub>0</sub> (active)
python34 @3.4.1<sub>1</sub> (active)
python<sub>select</sub> @0.3<sub>3</sub> (active)
readline @6.3.003<sub>0</sub> (active)
rsync @3.1.1<sub>0</sub> (active)
shared-mime-info @1.3<sub>0</sub> (active)
slurm @0.3.3<sub>0</sub> (active)
source-highlight @3.1.7<sub>0</sub> (active)
sqlite3 @3.8.6<sub>0</sub> (active)
swi-prolog @6.6.6<sub>0</sub>+mt (active)
texlive @2013<sub>0</sub>+doc+medium
yaml-mode.el @0.0.8<sub>0</sub> (active)
yasm @1.2.0<sub>0</sub>
yasm @1.3.0<sub>0</sub> (active)
zip @3.00<sub>0</sub> (active)
zlib @1.2.8<sub>0</sub>
zlib @1.2.8<sub>0</sub>+universal (active)
</p>
</div>
</div>

<div id="outline-container-sec-1-7-9" class="outline-4">
<h4 id="sec-1-7-9"><span class="section-number-4">1.7.9</span> Preferences</h4>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> TAing</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<a href="taNotes">General TA Notes</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jg</p>
<p class="date">Created: 2014-12-04 Thu 02:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
